БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/invАРМПС2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>invАРМПС2</name>
  <tabularSections>
    <name>Option</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BiomaterialId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/invЛабораторныеПараметры/invЛабораторныеПараметры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>invЛабораторныеПараметры</name>
  <type>
    <types>CatalogRef.ЗначенияПараметровЗабора</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>АдресКлиента_Город</name>
      <description>Адрес клиента: Город</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.ЗначенияПараметровЗабора</types>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Дом</name>
      <description>Адрес клиента: Дом</description>
      <code>000000015</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Индекс</name>
      <description>Адрес клиента: Индекс</description>
      <code>000000008</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Квартира</name>
      <description>Адрес клиента: Квартира</description>
      <code>000000017</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Корпус</name>
      <description>Адрес клиента: Корпус</description>
      <code>000000016</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_НаселенныйПункт</name>
      <description>Адрес клиента: Населенный пункт</description>
      <code>000000013</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Район</name>
      <description>Адрес клиента: Район</description>
      <code>000000011</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Регион</name>
      <description>Адрес клиента: Регион</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.ЗначенияПараметровЗабора</types>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Страна</name>
      <description>Адрес клиента: Страна</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.ЗначенияПараметровЗабора</types>
      </type>
    </items>
    <items>
      <name>АдресКлиента_СубъектФактическогоПроживания</name>
      <description>Адрес клиента: Субъект РФ (республика, область, край), фактическое проживание</description>
      <code>000000007</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресКлиента_ТипАдреса</name>
      <description>Адрес клиента: Тип адреса</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.ЗначенияПараметровЗабора</types>
      </type>
    </items>
    <items>
      <name>АдресКлиента_Улица</name>
      <description>Адрес клиента: Улица</description>
      <code>000000014</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ДокументКлиента_ДатаВыдачи</name>
      <description>Документ клиента: Дата выдачи</description>
      <code>000000005</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>ДокументКлиента_КемВыдан</name>
      <description>Документ клиента: Кем выдан</description>
      <code>000000004</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ДокументКлиента_Номер</name>
      <description>Документ клиента: Номер</description>
      <code>000000003</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ДокументКлиента_Серия</name>
      <description>Документ клиента: Серия</description>
      <code>000000002</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ДокументКлиента_ТипДокумента</name>
      <description>Документ клиента: Тип документа</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.ЗначенияПараметровЗабора</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Обязательное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Варианты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/Forms/ВыборДопМедИнформации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗ_ДМИ = Новый ТаблицаЗначений;
	ТЗ_ДМИ.Колонки.Добавить("AuxiliaryInfoId");
	Для каждого элтДМИ Из Параметры.IDДМИ Цикл
		стрТЗ_ДМИ = ТЗ_ДМИ.Добавить();
		стрТЗ_ДМИ.AuxiliaryInfoId = элтДМИ.AuxiliaryInfoId;
	КонецЦикла;
	ТЗ_ДМИ.Свернуть("AuxiliaryInfoId");
	
	ДобавляемыеРеквизиты = Новый Массив;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	Для каждого стр Из ТЗ_ДМИ Цикл
		УИ = Новый УникальныйИдентификатор(стр.AuxiliaryInfoId);
		Ссылка = ПланыВидовХарактеристик.invЛабораторныеПараметры.ПолучитьСсылку(УИ);
		Если ЗначениеЗаполнено(Ссылка.Код) Тогда
			ЗаголовокРФ = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Ссылка.Наименование," ",""),"/",""),"-",""),".",""),"+","");
			Реквизит = Новый РеквизитФормы(ЗаголовокРФ,Новый ОписаниеТипов(МассивТипов),,Строка(Ссылка.Наименование), Истина);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	
	Для каждого стр Из ТЗ_ДМИ Цикл
		УИ = Новый УникальныйИдентификатор(стр.AuxiliaryInfoId);
		Ссылка = ПланыВидовХарактеристик.invЛабораторныеПараметры.ПолучитьСсылку(УИ);
		Если ЗначениеЗаполнено(Ссылка.Код) Тогда
			ЗаголовокРФ = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Ссылка.Наименование," ",""),"/",""),"-",""),".",""),"+","");
			ЭлементФормы = ЭтаФорма.Элементы.Добавить(ЗаголовокРФ, Тип("ПолеФормы"), ЭтаФорма);
			ЭлементФормы.ПутьКДанным = ЗаголовокРФ; 
			ЭлементФормы.Вид         = ВидПоляФормы.ПолеВвода;
			Если Ссылка.Варианты.Количество() > 0 Тогда
				ЭлементФормы.РежимВыбораИзСписка = Истина;
				Для Каждого Вариант Из Ссылка.Варианты Цикл
					ЭлементФормы.СписокВыбора.Добавить(Вариант.Значение);
				КонецЦикла;
			КонецЕсли;
			Если Ссылка.Обязательное Тогда
				ЭлементФормы.Подсказка = "Обязательное заполнение";
				//ЭлементФормы.ШрифтЗаголовка = ШрифтыСтиля.ШрифтТекста;
				ЭлементФормы.ШрифтЗаголовка = Новый Шрифт(,,Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПродолжитьНаСервере()
	Структура = Новый Соответствие;
	Для Каждого стр Из Параметры.IDДМИ Цикл
		УИ = Новый УникальныйИдентификатор(стр.AuxiliaryInfoId);
		Ссылка = ПланыВидовХарактеристик.invЛабораторныеПараметры.ПолучитьСсылку(УИ);
		Если ЗначениеЗаполнено(Ссылка.Код) Тогда
			ЗаголовокРФ = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Ссылка.Наименование," ",""),"/",""),"-",""),".",""),"+","");
			Если Ссылка.Обязательное И НЕ ЗначениеЗаполнено(ЭтаФорма[ЗаголовокРФ]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена обязательная медицинская информация - " + Ссылка.Наименование + " !");
				Возврат
			КонецЕсли;
			 value = ЭтаФорма[ЗаголовокРФ];
			 Структура.Вставить(стр.AuxiliaryInfoId,value);
		КонецЕсли;
	КонецЦикла;
	Параметры.АдресХранилища = ПоместитьВоВременноеХранилище(Структура);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьОформление(Команда)
	ПродолжитьНаСервере();
	Если ЗначениеЗаполнено(Параметры.АдресХранилища) Тогда
		Закрыть(Параметры.АдресХранилища);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
